# language: ru

    @mailru
    Функционал: Отправка почты mail.ru
                Логин и пароль известны.
                Адрес почты получателя = адресу почты отправителя.

    Сценарий: Вход в почту
          Допустим , что открыта страница https://mail.ru
          Если ввести в поле 'Почта' логин
          И нажать на кнопку 'Ввести пароль'
          Также ввести в поле пароль
          И нажать на кнопку 'Войти'
          Тогда на странице отображается почтовый адресс вошедшего пользователя

    Сценарий: Отправка письма
          Если нажать на кнопку 'Написать письмо'
          И ввести аддрес получателя
          Также ввести тему письма
          И ввести текст письма
          К тому же нажать на кнопку 'Отправить'
          То появилось сообщение 'отправлено'

    Сценарий: Проверка, что отправленное письмо появилось в папке 'Отправленные'
          Допустим , что открыта папка 'Отправленные'
          Тогда у 1 письма в списке, адрес почты получателя = адресу почты отправителя
          И у 1 письма в списке, тема письма = теме отправленного письма

    Сценарий: Выход из почты
          Если нажать на кнопку 'Выход'
          Тогда появилось сообщение 'Войти в аккаунт'
