# language: ru

    @yandexru
    Функционал: Поиск сайта https://www.performance-lab.ru в поисковой системе https://yandex.ru/

    @success
    Структура сценария:
          Допустим , что открыта страница https://yandex.ru
          Если ввести в поле поиска "<запрос>"
          И нажать на кнопку 'Найти'
          Тогда искать ссылку с текстом "<название сайта>", на первых "<колличество>" страницах

       Примеры:
        | запрос                        | название сайта    |   колличество   |
        | услуги по тестированию по     | performance-lab   |   3             |
        | тестирование по               | performance-lab   |   30            |